**Free

/undefine comment
/if not defined(rpgleHeader)
/define rpgleHeader

  ctl-opt dftActGrp(*no) actGrp(*caller) alwNull(*usrCtl) datFmt(*iso) deBug(*yes) option(*srcstmt);

// PTF Waiting
// charCount(*natural);

/endif
