**FREE
//  reserved              char( 2) pos(63); // 62	3E	CHAR(2)	  Reserved
    jobRunPriority         int(10) pos(65); // 64	40	BINARY(4)	Run priority (job)
    timeSlice              int(10) pos(69); // 68	44	BINARY(4)	Time slice
    defaultWait            int(10) pos(73); // 72	48	BINARY(4)	Default wait
    purge                 char(10) pos(77); // 76	4C	CHAR(10)	Purge