**free

dcl-pr ifsReadFile   pointer extproc('_C_IFS_fgets');
  *n                 pointer value;                     // Retrieved data
  *n                 int(10) value;                     // Data size
  *n                 pointer value;                     // Misc pointer
end-pr;
