**free

dcl-pr jmis03cl extPgm('jmis03cl');
   *n             char(10) const; // To Library
   *n             char(10) const; // To File
   *n             char(10) const; // From Library
   *n             char(10) const; // From File
end-pr;