**Free

  dcl-ds MBRL0200;
    mbrl0200_memberNameUsed    char(10) inz('');
    mbrl0200_sourceType        char(10) inz('');
    mbrl0200_CreateDateTime    char(10) inz('');
    mbrl0200_lastChangeDate    char(10) inz('');
    mbrl0200_memberDescription char(10) inz('');
    mbrl0200_memberCCSID       char(10) inz('');
  end-ds;
