**Free

  dcl-ds MBRL0300;
    mbrl0300_memberNameUsed char(10) inz('');
    mbrl0300_reserved1      char(2)  inz('');
    mbrl0300_offset         int(10)  inz(0); // 0 No date
    mbrl0300_reserved1      char(16) inz('');
  end-ds;
